{
    "version": "https://jsonfeed.org/version/1",
    "title": "psychosomatic.co.za",
    "description": "",
    "home_page_url": "https://www.psychosomatic.co.za",
    "feed_url": "https://www.psychosomatic.co.za/feed.json",
    "user_comment": "",
    "icon": "https://www.psychosomatic.co.za/media/website/psycho-somatic-logo.webp",
    "author": {
        "name": "Dr. Jules S Greenstein"
    },
    "items": [
        {
            "id": "https://www.psychosomatic.co.za/posts/testing/",
            "url": "https://www.psychosomatic.co.za/posts/testing/",
            "title": "Psycho-(ˈsaɪ koʊ) So·mat·ic-(s-mtk)",
            "summary": "This is where psychology meets metaphysics to create a holistic approach to well-being. Our practice is rooted in the principles&hellip;",
            "content_html": "<p data-pm-slice=\"0 0 []\">This is where psychology meets metaphysics to create a holistic approach to well-being. Our practice is rooted in the principles of psychosomatic metaphysics, focusing on the profound connection between the mind, body, and spirit. We believe that mental and emotional states can deeply influence physical health and that addressing these interconnected aspects is key to lasting healing and personal growth.</p>\n<p data-pm-slice=\"0 0 []\">Through evidence-based psychological practices combined with metaphysical insights, we offer a unique path to self-discovery, emotional balance, and physical wellness. Whether you’re navigating stress, seeking deeper self-awareness, or striving for a harmonious life, our approach integrates therapeutic techniques with a broader understanding of how thought, emotion, and energy shape your reality.</p>\n<p data-pm-slice=\"0 0 []\">Let us guide you on a transformative journey toward aligning your inner world with your outer experience, empowering you to thrive in all aspects of life</p>",
            "image": "https://www.psychosomatic.co.za/media/posts/14/psycho-somatic-home-page-xl.webp",
            "author": {
                "name": "Dr. Jules S Greenstein"
            },
            "tags": [
            ],
            "date_published": "2025-02-18T20:46:13+02:00",
            "date_modified": "2025-02-18T21:21:01+02:00"
        }
    ]
}
