{
    "version": "https://jsonfeed.org/version/1",
    "title": "psychosomatic.co.za",
    "description": "",
    "home_page_url": "https://www.psychosomatic.co.za",
    "feed_url": "https://www.psychosomatic.co.za/feed.json",
    "user_comment": "",
    "icon": "https://www.psychosomatic.co.za/media/website/psycho-somatic-logo.webp",
    "author": {
        "name": "Dr. Jules S Greenstein"
    },
    "items": [
        {
            "id": "https://www.psychosomatic.co.za/posts/dreamscape/",
            "url": "https://www.psychosomatic.co.za/posts/dreamscape/",
            "title": "DreamScape",
            "summary": "I've had a vision for some time now. Can you imagine a customised non-contact device that tracks your dream activity&hellip;",
            "content_html": "<p>I've had a vision for some time now. Can you imagine a customised non-contact device that tracks your dream activity construct across the four areas of your brain associated thereunto, irrespective of the numerous positions that your head and body assumes during sleep?! </p>\n<p>You'de be able to wake up in the morning, press a button on your cranial tracker and download your dreams to a pod which connects to your computer or TV seemlessly, allowing you to replay your dreams with the exactness in every detail as to how they occured in your sleep prior.</p>\n<p>Ahead of its time?!..Perhaps, but one thing's for certain..Our dream material is useful in determining our underlying emotions and states of mind.</p>\n<p>In the meantime, my practice has some amazing solutions to a host of diverse challenges which you may be experiencing.</p>\n<p>Visit www.psychosomatic.co.za</p>\n<p> </p>",
            "author": {
                "name": "Dr. Jules S Greenstein"
            },
            "tags": [
            ],
            "date_published": "2025-03-05T12:31:01+02:00",
            "date_modified": "2025-03-05T12:31:33+02:00"
        },
        {
            "id": "https://www.psychosomatic.co.za/posts/see-the-light/",
            "url": "https://www.psychosomatic.co.za/posts/see-the-light/",
            "title": "See the light",
            "summary": "Pearls of wisdom that I discovered in the oyster shells collected by wise people and given to me. I shall&hellip;",
            "content_html": "<p>Pearls of wisdom that I discovered in the oyster shells collected by wise people and given to me.</p>\n<p>I shall be posting these gathered pearls of wisdom on my blog on my website so as to share with you and thus inspire you.</p>\n<p>Please take time to peruse my website and should you require any further assistance, please consult the options on the menu. Albeit PTSD, relationship and Intimacy issues, academic improvement or Sports performance management, we've got this. See the light.</p>",
            "author": {
                "name": "Dr. Jules S Greenstein"
            },
            "tags": [
            ],
            "date_published": "2025-02-22T13:11:33+02:00",
            "date_modified": "2025-02-22T18:00:41+02:00"
        }
    ]
}
